// ConsoleApplication3.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
#include <iomanip>
#include <windows.h>
#include <cstdlib>
#include <ctime>
using namespace std;


int main()
{
    SetConsoleOutputCP(1251);

    //1. Реалізувати калькулятор.Вводяться 2 будь - яких дійсних числа в змінні a і b.Необхідно вивести на екран меню з пунктами :
    //a + b
    //a - b
    //a * b
    //a / b
    //a % b
    //При виборі відповідного пункту меню відбувається виведення результату обчислення(повинна бути перевірка ділення на 0!)
    //Спробувати використати як драбинку іфів, та і свіч.
    //
    cout << "\n\tЗАВДАННЯ 1\n\n";

    cout << "Hello World!\n";

    double a;
    double b;
    int choice;

    cout << "Введіть 2 будь - яких дійсних числа:" << endl;

    cout << "Введіть перше число a: ";
    cin >> a;
    cout << "Введіть друге число b: ";
    cin >> b;

    cout << "Виберіть необхідну дію:\n" << endl 
        << "1 : a + b " << endl 
        << "2 : a - b " << endl 
        << "3 : a * b " << endl 
        << "4 : a / b " << endl
        << "5 : a % b " << endl;

    cin >> choice;

    cout << "==========================" << endl;

    //Реалізація через if - else

    if (choice == 1) {
        cout << a << " + " << b << " = " << a + b << endl;
    }
    else if (choice == 2) {
        cout << a << " - " << b << " = " << a - b << endl;    
    }
    else if (choice == 3) {
        cout << a << " * " << b << " = " << a * b << endl;
    }
    else if (choice == 4) {
        if (b == 0) {
            cout << "УВАГА! Ділення на 0 неможливе!";
        } else { cout << a << " / " << b << " = " << a / b << endl;}        
    }
    else if (choice == 5) {
        if (b == 0) {
            cout << "УВАГА! Ділення на 0 неможливе!";
        }
        else { cout << a << " % " << b << " = " << (int)a % (int)b << endl; }
    }
    else { cout << "Такого пункту меню немає!"; }

    cout << "==========================" << endl;

    //Реалізація через switch

    switch (choice)
    {
    case 1: cout << a << " + " << b << " = " << a + b << endl;
        break;

    case 2: cout << a << " - " << b << " = " << a - b << endl;
        break;

    case 3: cout << a << " * " << b << " = " << a * b << endl;
        break;

    case 4: 
        if (b == 0) {cout << "УВАГА! Ділення на 0 неможливе!";}
          else { cout << a << " / " << b << " = " << a / b << endl;}
        break;

    case 5:
        if (b == 0) { cout << "УВАГА! Ділення на 0 неможливе!"; }
        else { cout << a << " % " << b << " = " << (int)a % (int)b << endl; }
        break;

    default:
        cout << "Такого пункту меню немає!";
        break;
    }
    system("pause");

    //2. Написати гру "Хто хоче стати мільйонером?".На екрані по черзі з'являються питання та варіанти відповідей.
    //Неправильний вибір – гра завершена.Правильна відповідь – переходимо до наступного питання.
    //Якщо всі відповіді правильні – в кінці виводиться повідомлення про перемогу.
    // За бажанням можна реалізувати незгораючі суми, підказки, звукові ефекти* і т.д.

    cout << "\n\tЗАВДАННЯ 2\n\n";
    
    cout << "Вітаємо у грі Хто хоче стати мільйонером!" << endl
        << "Сьогодні саме ви маєте шанс випробувати свої знання, кмітливість і логіку, \nщоб пройти всі рівні та дістатися фінального запитання." << endl
        << "На вас чекають 10 питань, кожне з яких буде складнішим за попереднє." << endl
        << "Ви маєте чотири варіанти відповіді, але лише один з них є правильним." << endl
        << "Якщо сумніваєтесь – не хвилюйтеся!\nДля кожного питання передбачені підказки, які допоможуть Вам знайти вірний шлях." << endl
        << "Чи готові ви розпочати гру і дізнатися, наскільки ви близькі до мільйона ? Тоді нехай удача буде на вашому боці!\n" << endl
        << "\nПравильні відповіді вам принесуть:";

    cout << "\n1 - 5 000.00\n2 - 10 000.00\n3 - 15 000.00\n4 - 25 000.00 - незгораюча сума\n5 - 50 000.00\n6 - 80 000.00\n7 - 125 000.00\n8 - 250 000.00 - незгораюча сума\n9 - 500 000.00\n10 - 1 000 000.00\n"; 
    cout << "\nПротягом гри Ви можете скористатись трьома підказками:" << endl
        << "\n50:50\nОпитування\nДопомога ШІ\n";

    system("pause");

    double win_amount = 0;

    int option, 
        fiftyfifty = 1, 
        research = 1, 
        ai_help = 1, 
        count = 0;

    cout << "\nПЕРШЕ ПИТАННЯ НА 5 000,00:\nЯкого кольору небо в ясний день?\n(1) - Червоне \n(2) - Зелене \n(3) - Синє \n(4) - Жовте\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - " 
        << fiftyfifty <<" I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

    cout << "\nЗробіть свій вибір (1-7)" << endl;
    cin >> option;
    if (option == 3) {
        cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
        count += 1;
    }
    else if (option == 5) {

        if (fiftyfifty == 1) {
            cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
            cout << "\n(1)\n(2) - Зелене\n(3) - Синє\n(4)\n" << endl;
            fiftyfifty = 0;
        }
        else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

        cout << "Зробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
            count += 1;
        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Червоне - 10%\n(2) - Зелене - 10%\n(3) - Синє - 70%\n(4) - Жовте - 10%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                count += 1;
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це колір, який асоціюється з морем, а також є на прапорі України" << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажаль - це не правильна відповідь!";
            }

        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це колір, який асоціюється з морем, а також є на прапорі України" << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;
            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Червоне - 10%\n(2) - Зелене - 10%\n(3) - Синє - 70%\n(4) - Жовте - 10%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }
                
                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }
            }
            else {
                cout << "Нажль - це правильна відповідь!";
            }

        }
        else {
            cout << "Нажль - це не правильна відповідь!";
        }


    }
    else if (option == 6) {

        if (research == 1) { 
            cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
            cout << "\n(1) - Червоне - 10%\n(2) - Зелене - 10%\n(3) - Синє - 70%\n(4) - Жовте - 10%\n" << endl;
            research = 0;
        }
        else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

        cout << "Зробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - Зелене\n(3) - Синє\n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                count += 1;
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це колір, який асоціюється з морем, а також є на прапорі України" << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це колір, який асоціюється з морем, а також є на прапорі України" << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            
            if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - Зелене\n(3) - Синє\n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }
    else if (option == 7) {

        if (ai_help == 1) {
            cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це колір, який асоціюється з морем, а також є на прапорі України" << endl;
            ai_help = 0;
        }
        else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

        cout << "Зробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - Зелене\n(3) - Синє\n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Червоне - 10%\n(2) - Зелене - 10%\n(3) - Синє - 70%\n(4) - Жовте - 10%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }

        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Червоне - 10%\n(2) - Зелене - 10%\n(3) - Синє - 70%\n(4) - Жовте - 10%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;
            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - Зелене\n(3) - Синє\n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 5 000,00" << endl;
                    count += 1;
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }
    else { cout << "Нажль - це не правильна відповідь!"; }

    if (count == 1) {

        cout << "\nДРУГЕ ПИТАННЯ НА 10 000,00:\nЯка планета найближча до Сонця?\n(1) - Меркурій \n(2) - Венера \n(3) - Земля \n(4) - Марс\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 1) {
            cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1) - Меркурій \n(2)\n(3) - Земля \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Меркурій - 90%\n(2) - Венера - 5%\n(3) - Земля - 2%\n(4) - Марс - 3%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Вона названа на честь римського бога. Також назва схожа з маркою авто Мерседес" << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Вона названа на честь римського бога. Також назва схожа з маркою авто Мерседес" << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Меркурій - 90%\n(2) - Венера - 5%\n(3) - Земля - 2%\n(4) - Марс - 3%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Меркурій - 90%\n(2) - Венера - 5%\n(3) - Земля - 2%\n(4) - Марс - 3%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Меркурій \n(2)\n(3) - Земля \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Вона названа на честь римського бога. Також назва схожа з маркою авто Мерседес" << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Вона названа на честь римського бога. Також назва схожа з маркою авто Мерседес" << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Меркурій \n(2)\n(3) - Земля \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Вона названа на честь римського бога. Також назва схожа з маркою авто Мерседес" << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Меркурій \n(2)\n(3) - Земля \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Меркурій - 90%\n(2) - Венера - 5%\n(3) - Земля - 2%\n(4) - Марс - 3%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Меркурій - 90%\n(2) - Венера - 5%\n(3) - Земля - 2%\n(4) - Марс - 3%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Меркурій \n(2)\n(3) - Земля \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 10 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 2) {

        cout << "\nТРЕТЄ ПИТАННЯ НА 15 000,00:\nЯкий напій отримують з обсмажених зерен?\n(1) - Чай \n(2) - Кава \n(3) - Какао \n(4) - Лимонад\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 2) {
            cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - Кава \n(3)\n(4) - Лимонад\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Чай - 15% \n(2) - Кава - 55% \n(3) - Какао - 25% \n(4) - Лимонад - 5%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Багато людей п’ють цей напій вранці, щоб прокинутися." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Багато людей п’ють цей напій вранці, щоб прокинутися." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Чай - 15% \n(2) - Кава - 55% \n(3) - Какао - 25% \n(4) - Лимонад - 5%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Чай - 15% \n(2) - Кава - 55% \n(3) - Какао - 25% \n(4) - Лимонад - 5%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - Кава \n(3)\n(4) - Лимонад\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Багато людей п’ють цей напій вранці, щоб прокинутися." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Багато людей п’ють цей напій вранці, щоб прокинутися." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - Кава \n(3)\n(4) - Лимонад\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Багато людей п’ють цей напій вранці, щоб прокинутися." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - Кава \n(3)\n(4) - Лимонад\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Чай - 15% \n(2) - Кава - 55% \n(3) - Какао - 25% \n(4) - Лимонад - 5%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Чай - 15% \n(2) - Кава - 55% \n(3) - Какао - 25% \n(4) - Лимонад - 5%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - Кава \n(3)\n(4) - Лимонад\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 15 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 3) {

        cout << "\nЧЕТВЕРТЕ ПИТАННЯ НА 25 000,00 - ПЕРША незгораюча сумма:\nЯка тварина є символом мудрості?\n(1) - Лисиця \n(2) - Вовк \n(3) - Сова \n(4) - Орел\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1) - Лисиця \n(2)\n(3) - Сова \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Лисиця - 23% \n(2) - Вовк - 24% \n(3) - Сова - 27% \n(4) - Орел - 26%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей птах часто зустрічається в казках і пов’язаний з ніччю." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей птах часто зустрічається в казках і пов’язаний з ніччю." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Лисиця - 23% \n(2) - Вовк - 24% \n(3) - Сова - 27% \n(4) - Орел - 26%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Лисиця - 23% \n(2) - Вовк - 24% \n(3) - Сова - 27% \n(4) - Орел - 26%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Лисиця \n(2)\n(3) - Сова \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей птах часто зустрічається в казках і пов’язаний з ніччю." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей птах часто зустрічається в казках і пов’язаний з ніччю." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Лисиця \n(2)\n(3) - Сова \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей птах часто зустрічається в казках і пов’язаний з ніччю." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Лисиця \n(2)\n(3) - Сова \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Лисиця - 23% \n(2) - Вовк - 24% \n(3) - Сова - 27% \n(4) - Орел - 26%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Лисиця - 23% \n(2) - Вовк - 24% \n(3) - Сова - 27% \n(4) - Орел - 26%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Лисиця \n(2)\n(3) - Сова \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 25 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 4) {

        win_amount = 25000.00;

        cout << "ВІТАЄМО! ВИ ОТРИМАЛИ ПЕРШУ НЕЗГОРАЮЧУ СУММУ - 25 000\nП'ЯТЕ ПИТАННЯ НА 50 000,00." 
             << "\nЯкий тип даних використовується для зберігання цілих чисел у C++ ? \n(1) - float \n(2) - int \n(3) - string \n(4) - double\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
             << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 2) {
            cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1) - float \n(2) - int \n(3)\n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - float - 11% \n(2) - int - 77% \n(3) - string - 7% \n(4) - double - 15%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей тип називається скорочено від integer." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей тип називається скорочено від integer." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - float - 11% \n(2) - int - 77% \n(3) - string - 7% \n(4) - double - 15%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - float - 11% \n(2) - int - 77% \n(3) - string - 7% \n(4) - double - 15%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - float \n(2) - int \n(3)\n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей тип називається скорочено від integer." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей тип називається скорочено від integer." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - float \n(2) - int \n(3)\n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Цей тип називається скорочено від integer." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - float \n(2) - int \n(3)\n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - float - 11% \n(2) - int - 77% \n(3) - string - 7% \n(4) - double - 15%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - float - 11% \n(2) - int - 77% \n(3) - string - 7% \n(4) - double - 15%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - float \n(2) - int \n(3)\n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 50 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 5) {

        cout << "\nШОСТЕ ПИТАННЯ НА 80 000,00."
            << "\nЧому дорівнює 2^5? \n(1) - 8 \n(2) - 16 \n(3) - 32 \n(4) - 64\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - 16 \n(3) - 32 \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 8 - 11% \n(2) - 16 - 22%\n(3) - 32 - 34% \n(4) - 64 - 33%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це 2, помножене саме на себе 5 разів." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це 2, помножене саме на себе 5 разів." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 8 - 11% \n(2) - 16 - 22%\n(3) - 32 - 34% \n(4) - 64 - 33%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - 8 - 11% \n(2) - 16 - 22%\n(3) - 32 - 34% \n(4) - 64 - 33%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 16 \n(3) - 32 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це 2, помножене саме на себе 5 разів." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це 2, помножене саме на себе 5 разів." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 16 \n(3) - 32 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це 2, помножене саме на себе 5 разів." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 16 \n(3) - 32 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 8 - 11% \n(2) - 16 - 22%\n(3) - 32 - 34% \n(4) - 64 - 33%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 8 - 11% \n(2) - 16 - 22%\n(3) - 32 - 34% \n(4) - 64 - 33%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 16 \n(3) - 32 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 80 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 6) {

        cout << "\nСЬОМЕ ПИТАННЯ НА 125 000,00."
            << "\nЯкий оператор використовується для взяття залишку від ділення у програмуванні?\n(1) - % \n(2) - * \n(3) - / \n(4) - $\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 1) {
            cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1) - % \n(2)\n(3) - / \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - % - 80%\n(2) - * - 5%\n(3) - / - 11%\n(4) - $ - 4%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Він схожий на знак відсотка." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Він схожий на знак відсотка." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - % - 80%\n(2) - * - 5%\n(3) - / - 11%\n(4) - $ - 4%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - % - 80%\n(2) - * - 5%\n(3) - / - 11%\n(4) - $ - 4%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - % \n(2)\n(3) - / \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Він схожий на знак відсотка." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Він схожий на знак відсотка." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - % \n(2)\n(3) - / \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Він схожий на знак відсотка." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 1) {
                cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - % \n(2)\n(3) - / \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - % - 80%\n(2) - * - 5%\n(3) - / - 11%\n(4) - $ - 4%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - % - 80%\n(2) - * - 5%\n(3) - / - 11%\n(4) - $ - 4%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 1) {
                    cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - % \n(2)\n(3) - / \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 1) {
                        cout << "Це правильна відповідь! Ви виграли - 125 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 7) {

        cout << "\nВОСЬМЕ ПИТАННЯ НА 250 000,00. - ДРУГА незгораюча сумма:"
            << "\nСкільки граней має куб?\n(1) - 4 \n(2) - 6 \n(3) - 8 \n(4) - 10\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 2) {
            cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - 6 \n(3) - 8 \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 4 - 4% \n(2) - 6 - 78% \n(3) - 8 - 8% \n(4) - 10 - 10%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це тривимірна фігура, що складається з квадратів." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це тривимірна фігура, що складається з квадратів." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 4 - 4% \n(2) - 6 - 78% \n(3) - 8 - 8% \n(4) - 10 - 10%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - 4 - 4% \n(2) - 6 - 78% \n(3) - 8 - 8% \n(4) - 10 - 10%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 6 \n(3) - 8 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це тривимірна фігура, що складається з квадратів." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це тривимірна фігура, що складається з квадратів." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 6 \n(3) - 8 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Це тривимірна фігура, що складається з квадратів." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 2) {
                cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 6 \n(3) - 8 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 4 - 4% \n(2) - 6 - 78% \n(3) - 8 - 8% \n(4) - 10 - 10%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 4 - 4% \n(2) - 6 - 78% \n(3) - 8 - 8% \n(4) - 10 - 10%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 2) {
                    cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 6 \n(3) - 8 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 2) {
                        cout << "Це правильна відповідь! Ви виграли - 250 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 8) {

        win_amount = 250000.00;

        cout << "\nВІТАЄМО! ВИ ОТРИМАЛИ ДРУГУ НЕЗГОРАЮЧУ СУММУ - 250 000\nДЕВ'ЯТЕ ПИТАННЯ НА 500 000,00."
            << "\nЯка країна є батьківщиною Піфагора?\n(1) - Єгипет \n(2) - Італія \n(3) - Греція \n(4) - Китай\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1) - Єгипет \n(2)\n(3) - Греція \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Єгипет - 30% \n(2) - Італія - 31% \n(3) - Греція - 32% \n(4) - Китай - 7%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Ця країна славиться філософами, міфами та Олімпійськими іграми." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Ця країна славиться філософами, міфами та Олімпійськими іграми." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Єгипет - 30% \n(2) - Італія - 31% \n(3) - Греція - 32% \n(4) - Китай - 7%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - Єгипет - 30% \n(2) - Італія - 31% \n(3) - Греція - 32% \n(4) - Китай - 7%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Єгипет \n(2)\n(3) - Греція \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Ця країна славиться філософами, міфами та Олімпійськими іграми." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Ця країна славиться філософами, міфами та Олімпійськими іграми." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Єгипет \n(2)\n(3) - Греція \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n Ця країна славиться філософами, міфами та Олімпійськими іграми." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1) - Єгипет \n(2)\n(3) - Греція \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - Єгипет - 30% \n(2) - Італія - 31% \n(3) - Греція - 32% \n(4) - Китай - 7%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - Єгипет - 30% \n(2) - Італія - 31% \n(3) - Греція - 32% \n(4) - Китай - 7%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1) - Єгипет \n(2)\n(3) - Греція \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 500 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 9) {

        cout << "\nВІТАЄМО! ВИ ДІЙШЛИ ДО ОСТАННЬОГО ПИТАННЯ НА 1 000 000\nОСТАННЄ ПИТАННЯ:"
            << "\nЩо поверне вираз 5 / 2 у мові програмування Python?\n(1) - 2 \n(2) - 2,5 \n(3) - 2.5 \n(4) - 2.0\n\nВАШІ ПІДКАЗКИ\n\(5) - 50:50 - "
            << fiftyfifty << " I (6) - Опитування - " << research << " I (7) - Допомога ШІ - " << ai_help;

        cout << "\nЗробіть свій вибір (1-7)" << endl;
        cin >> option;

        if (option == 3) {
            cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
            count += 1;
        }
        else if (option == 5) {

            if (fiftyfifty == 1) {
                cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                cout << "\n(1)\n(2) - 2,5 \n(3) - 2.5 \n(4)\n" << endl;
                fiftyfifty = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                count += 1;
            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 2 - 3% \n(2) - 2,5 - 33% \n(3) - 2.5 - 34% \n(4) - 2.0 - 30%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n У Python ділення завжди повертає число з плаваючою комою." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }

                }
                else {
                    cout << "Нажаль - це не правильна відповідь!";
                }

            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n У Python ділення завжди повертає число з плаваючою комою." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 2 - 3% \n(2) - 2,5 - 33% \n(3) - 2.5 - 34% \n(4) - 2.0 - 30%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else {
                        cout << "Нажль - це правильна відповідь!";
                    }
                }
                else {
                    cout << "Нажль - це правильна відповідь!";
                }

            }
            else {
                cout << "Нажль - це не правильна відповідь!";
            }


        }
        else if (option == 6) {

            if (research == 1) {
                cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                cout << "\n(1) - 2 - 3% \n(2) - 2,5 - 33% \n(3) - 2.5 - 34% \n(4) - 2.0 - 30%\n" << endl;
                research = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 2,5 \n(3) - 2.5 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                    count += 1;
                }
                else if (option == 7) {

                    if (ai_help == 1) {
                        cout << "Ви вибрали підказку Допомога ШІ і вона така:\n У Python ділення завжди повертає число з плаваючою комою." << endl;
                        ai_help = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else if (option == 7) {

                if (ai_help == 1) {
                    cout << "Ви вибрали підказку Допомога ШІ і вона така:\n У Python ділення завжди повертає число з плаваючою комою." << endl;
                    ai_help = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;


                if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 2,5 \n(3) - 2.5 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else if (option == 7) {

            if (ai_help == 1) {
                cout << "Ви вибрали підказку Допомога ШІ і вона така:\n У Python ділення завжди повертає число з плаваючою комою." << endl;
                ai_help = 0;
            }
            else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

            cout << "Зробіть свій вибір (1-7)" << endl;
            cin >> option;

            if (option == 3) {
                cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                count += 1;
            }
            else if (option == 5) {

                if (fiftyfifty == 1) {
                    cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                    cout << "\n(1)\n(2) - 2,5 \n(3) - 2.5 \n(4)\n" << endl;
                    fiftyfifty = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;

                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                    count += 1;
                }
                else if (option == 6) {

                    if (research == 1) {
                        cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                        cout << "\n(1) - 2 - 3% \n(2) - 2,5 - 33% \n(3) - 2.5 - 34% \n(4) - 2.0 - 30%\n" << endl;
                        research = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;

                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }
                }
                else { cout << "Нажль - це не правильна відповідь!"; }

            }
            else if (option == 6) {

                if (research == 1) {
                    cout << "Ви вибрали підказку Опитування. Ми провели опитування стосовно цього питання і воно показало:" << endl;
                    cout << "\n(1) - 2 - 3% \n(2) - 2,5 - 33% \n(3) - 2.5 - 34% \n(4) - 2.0 - 30%\n" << endl;
                    research = 0;
                }
                else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                cout << "Зробіть свій вибір (1-7)" << endl;
                cin >> option;
                if (option == 3) {
                    cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                    count += 1;
                }
                else if (option == 5) {

                    if (fiftyfifty == 1) {
                        cout << "Ви вибрали підказку 50:50. Ми приберемо дві неправильні відповіді:" << endl;
                        cout << "\n(1)\n(2) - 2,5 \n(3) - 2.5 \n(4)\n" << endl;
                        fiftyfifty = 0;
                    }
                    else { cout << "Ви вже скористались цією підказкою. Зробіть інший вибір!" << endl; }

                    cout << "Зробіть свій вибір (1-7)" << endl;
                    cin >> option;
                    if (option == 3) {
                        cout << "Це правильна відповідь! Ви виграли - 1 000 000,00" << endl;
                        count += 1;
                    }
                    else { cout << "Нажль - це не правильна відповідь!"; }

                }
                else { cout << "Нажль - це не правильна відповідь!"; }
            }
            else { cout << "Нажль - це не правильна відповідь!"; }
        }
        else { cout << "Нажль - це не правильна відповідь!"; }
    }

    if (count == 10) {
        win_amount = 1000000.00;
        cout << "\nВІТАЄМО! ВИ ВІДПОВІЛИ НА ВСІ ПИТАННЯ І ВИГРАЛИ 1 000 000" << endl;
    }
    else if (count < 10 and win_amount > 0) {
        cout << "\nВІТАЄМО! ЗАВДЯКИ НЕЗГОРАЮЧІЙ СУМІ ВИ ВИГРАЄТЕ - " << win_amount << endl;
    }
    else {
        cout << "\nНЕ ВТРАЧАЙТЕ ДУХУ! МИ ВПЕВНЕНІ НАСТУПНОГО РАЗУ ВАМ ПОЩАСТИТЬ!" << endl;
    }

    system("pause");

    //3. Реалізувати програму «Мольфар 4000».Користувач вводить питання.Програма дає випадкову відповідь з набору заздалегідь передбачених відповідей(5 позитивних, 5 негативних, 10 нейтральних варіантів).
    
    cout << "\n\tЗАВДАННЯ 3\n\n";

    int q1 = 1, q2 = 20, unswer;
    string qwestion;

    cout << " ВАС ВІТАЄ МОЛЬФАР 4000. ЗАДАЙТЕ СВОЄ ПИТАННЯ ТА ОТРИМАЙТЕ НАЙТОЧНІШУ ВІДПОВІДЬ У ВСЕСВІТІ!" << endl;
    cout << " ЗАДАЙТЕ СВОЄ ПИТАННЯ: ";
    cin >> qwestion;
    cout << "\n МОЛЬФАР отримав Ваше запитання і його дповідь така:" << endl;

    system("pause");

    srand(time(0));
    unswer = q1 + rand() % (q2 - q1 + 1);

    switch (unswer)
    {
    case 1: cout <<" Так, і навіть зірки це підтверджують! " << endl;
        break;

    case 2: cout << " Безперечно! Це здійсниться! " << endl;
        break;

    case 3: cout << " Доля каже «так», і я з нею згоден! " << endl;
        break;
    
    case 4: cout << " Все складеться ідеально! " << endl;
        break;
    
    case 5: cout << " Щастя вже стукає у двері, відкривай! " << endl;
        break;

    case 6: cout << "Ні, навіть не мрій... " << endl;
        break;
    case 7: cout << " Як кажуть у Карпатах: Туманно, але навряд. " << endl;
        break;
    case 8: cout << " Забудь про це. Краще випий чаю. " << endl;
        break;
    case 9: cout << " Небеса мовчать, але я чую тихеньке ні…! " << endl;
        break;
    case 10: cout << " Якщо це зробиш, готуй план «Б»… і «В»… і «Г»… " << endl;
        break;
    case 11: cout << " Шанси є, але кому вони потрібні? " << endl;
        break;
    case 12: cout << " Запитай ще раз, коли місяць буде у ретроградному Юпітері. " << endl;
        break;
    case 13: cout << " 50/50, як у лотереї.  " << endl;
        break;
    case 14: cout << " Життя – це загадка, а я не Ванга. " << endl;
        break;
    case 15: cout << " Все залежить від настрою кота Шредінгера… " << endl;
        break;
    case 16: cout << " Я б сказав, але не хочу псувати інтригу. " << endl;
        break;
    case 17: cout << " Якщо віриш – то буде. Якщо ні – то теж. " << endl;
        break;
    case 18: cout << " Відповідь у твоєму серці… або в Google. " << endl;
        break;
    case 19: cout << " Десь у паралельному всесвіті – так. " << endl;
        break;
    case 20: cout << " Всі знаки вказують на… каву! " << endl;
        break;    
    }
    system("pause");
    
}